5-1-101  (大群内无此邻居，请求联系寻找)
5-1-201  (大群内无此邻居，请求联系寻找)
5-1-301
5-1-401                                                       会议
5-1-501  (大群内无此邻居，请求联系寻找)
5-1-601  (大群内无此邻居，请求联系寻找)
5-1-701
5-1-801                                                       会议
5-1-901  (大群内无此邻居，请求联系寻找)
5-1-1001 (大群内有此邻居，但未进小群 --------------)
5-1-1101  (大群内无此邻居，请求联系寻找)
5-1-1201  (大群内无此邻居，请求联系寻找)
5-1-1301                                                       会议
5-1-1401                                                       会议
5-1-1501
5-1-1601  (大群内无此邻居，请求联系寻找)
5-1-1701
5-1-1801
5-1-1901                                                       会议
5-1-2001  (大群内无此邻居，请求联系寻找)
5-1-2101
5-1-2201
5-1-2301                                                       会议







可能我很让人反感，叨扰了你们。但是我也不想这样， 都是为了房子。
@5-1-301 @5-1-2101 @5-1-1501 @5-1-1801
很抱歉，打扰你们，各位邻居。 但是希望你们能够参与，一起为维权努力。
你们如果也能参加， 我们能一次性说清。  不然还要重复好多遍。

感谢各位邻居的支持，我们 20:30 准时开始， 希望没看到消息的邻居们也能参加。
微信语音会议  今晚 20:30

目前参与9户：
5-1-401
5-1-701
5-1-801
5-1-1301
5-1-1401
5-1-1701
5-1-1901
5-1-2201
5-1-2301

未联系上的邻居
5-1-301
5-1-1501
5-1-1801
5-1-2101

