/*
    开发

        做成了什么事？ 产生了什么效益？

1. 听得懂，明白    ，图帮助展示数据

    视频会议
        过程
            编译C++
            windows/Mac/网页 平台
            electron升级引发的兼容性问题，旧的投屏不能正常使用

            疫情期间， 家庭网络不好，沟通成本高。别人轮休，自己多次来公司加班

        结果
        效果

    350



    服务

    团队建设






            声网     zoom

       使用时长
       并发承载量  最多可以承载多少人
       稳定性
       故障响应及处理时间   变短
       客户投诉率






    什么是成功？











成长之路          1
工作亮点          4
挑战及建议解决方案  1
自我分析：        1
自我定位：        1
我的收获与成长：   2



//具体话术的解释

冉成2020述职报告


智能产品部--北京/朝阳men--冉成

                                                        前端架构师
                                                            如何设计性能更好的飞机，而不是简单的组装飞机

                                                            个人为什么不推荐使用react-redux

                                                                别人认为， 这是规范。大部分人都在用。但是我不这么认为。

                                                                代码量太大，不利于提升团队的开发效率，
                                                                我有自己的想法和自己设计的解决方案，组件管理器。可以少少量的代码，来实现组件间的通信。


我的梦想加成长之路  (1分钟)
    主要工作职责：
        设计项目架构，全局把控质量
        技术难点攻关

        擅长前端框架设计，前端领域的开发工作。


    关键事项
        2019.3 - 2019.5    带领团队3个月完成新运营系统1期。
                           3周独立攻克技术难点，设计完成场地销控图。   可画，可拖动，放大缩小， 可绑定

        2019.8 - 2019.12   2人的成本承担了智效的全部工作，包括mTool 微信公众号， so ,iot， update平台 。
                           分析mtool现有的问题，以及提出了mtool的重构方案。
                           （打印问题，域账号，vpn,root权限，系统设置mac兼容性问题，mac系统权限）


         2020.2 - 2020.5   独立承担了90%的视频会议开发工作。
                           完成了windows/mac 双平台的难点攻关，
                           协助分析electron 版本升级后的兼容性问题，并提出解决方案。
                           同时参与招聘，并且指导新人完成了一些辅助工作。


2020年 工作亮点 （4分钟）

更好的视频会议服务，更好的梦想加口碑
1.
    2020年，作为前端架构师，视频会议使用时长增长了6倍，稳定性有了大幅度提升，掉线率降到了1%，客诉率下降了20%。

    实现方法：
        1. 接入稳定性更好的第三方zoom，使得发起和加入视频会议更加的稳定
        2. 在update平台，开发账号池，实现了zoom账号的动态管理，用最少的账号，满足最大的客户需求量。


2.  2020年，作为前端架构师，认证一体机，商汤人脸识别。




实现方法（过程）
    技巧： 突出独自一人。招聘，协调工作，技术难点，疫情

    （虽然完成了视频会议，但是过程很是艰辛）

    招聘工作 就是开局
        （年初因为郝良的离职，项目组就只有我一人，第一个面临的 就是招聘工作。
        在新同事入职之前，只能自己只身一人投入调研开发工作。）

    开发工作 一波三折（技术难度大）
            1. 调研期间的障碍： 网页版zoom方案被迫放弃，转而选择桌面版zoom方案
                    （对于前端来说，最理想的是网页版视频会议，这是我们的专业，但是经调研后发现功能不全，只能选择放弃这个方案。）

            2. 开发前的障碍：  想开发桌面版视频会议，必须先升级electron，进而要先解决升级后 引发的兼容性问题。

                    （
                      如一些api被废弃, electron 不能正常发版。
                    ）


            3. 开发中的困难和压力： 先攻克mac版视频会议，再转战windows版本视频会议

                （解决了兼容性问题之后，终于可以开始开发视频会议了，

                测试同学压力也很大，多次催促，只能先交付mac版本。然后一边开发windows版本，一边解决mac版本的bug。

                研究windows32位对于我来说是一个新的领域。经过努力调研之后，终于突破了这个难题。
                ）

            4.解决兼容性问题。解决投屏的问题

    分配任务 分担压力，共同推进
        经过一个多月的招聘工作 终于招来了郭雨。
        郭雨承担了视频会议的一些业务逻辑，
        另外还承担了视频会议之外的其他两个项目：风机排管，大屏门禁。


    面对压力
        加班
            面对人少活多技术难度大，我们选择加班应对
            一方面做调研，一方面做实验demo验证。

        疫情期间 频繁来公司
            疫情增加了工作的难度
            1. 家里网络差，影响了开发效率。（发版总是失败）
            2. 远程办公，增加了沟通成本。描述问题，和复现问题，增加了难度。
            除了正常轮班来公司，还要赶在测试来公司的时候来

            （周六来公司，周五忘记了填好疫情信息采集  一楼门卫大爷死活不让进。不得已跟社区经理周智鹏打电话，又重新填写
            采集信息，并且审批后，才让进去的。）

    视频会议仍然存在一些问题。
        有的mac系统权限不够



会议新运营的例子，给他们讲。未来应对他们的提问。
发票开具优化


    提升开发票的效率和准确率

    客户不同订单可以合并开票
    将账单金额同步到发票金额
    使每一笔账目更加的明确



重要事项
    我们用了半个月的时间完成了 楼宇管理模块拆分

       对于开发维护的好处
           1. 新运营的体量变得相对较小，打包发布速度变快。

           2. 楼宇管理可以作为单独系统，独立维护，发布。
           3. 对楼宇管理进行了代码优化，使其变得更加健壮。
               如 对其中的销控图做了优化调整，销控图弹窗变大，放置更多关键信息。


       对于私有化输出的好处（为新运营的私有化输出做好准备）
           1. 可以作为单独模块对外售卖
           2. 也可以和新运营系统一起打包对外售卖。



其他的工作
    近期开发完成的人证一体机，已经进入了龙湖的竞标阶段，祝愿竞标成功。
    正在筹备中的webRtc分享，将在下个月对外分享，大家多多参与。


完成了多少页面，修复了多少bug
，参与了多少面试，招到了多少人


解决设备故障
    mtool 打印     （并且结识了来自于厄立特里亚的外国朋友Michael）
    mtool 投屏
    350门禁

团队建设
    1.我通过参与招聘活动，并且严格把关，为公司招聘到了合适的人才。
    2.参与webRtc分享,提升团队的技术。




研究成果  （componentStore）



人证一体机接入访客拜访流程   流动工位   人脸识别    同步卡号

token
    为了满足私有云客户的人脸识别定制化需求，引入了商汤，阿里，百度 人脸识别

 发票开具优化

    提升开发票的效率和准确率

    客户不同订单可以合并开票
    将账单金额同步到发票金额




 商品  订单  资金流水记录  销控图  费用类型设置   输出楼宇


    1、2020年工作亮点，主要体现为当前已有确定成效且可复制推广的工作成果（提供推广建议） ，不超过3项；
    如有尚未确定成效或仅适用于个别场地、不适于大范围推广的工作，也可简要列述，并说明在其中承担的角色和发挥的作用。

    1、当前已有确定成效且可复制推广的工作成果：
    2020年，作为前端架构师，视频会议使用时长增长了6倍，稳定性提升了50%，并发承载量提升了3倍，客诉率下降了20%。
    实现方法：
    1）通过客户关键人关系维护，重要人员关怀等方式增进客户感情，适用于XX类型客户，推广建议：
    2）通过。。。


    投屏兼容性问题研究和解决。
    webRtc 技术的深入学习研究，并可以进行分享


    2、2020年工作中的重要事项及完成情况，主要体现为对公司/部门/产品/团队长远发展有重要意义的事项，不超过3项

    视频会议     基本按期完成交付使用     提升视频会议的服务稳定性，提升梦想加的品牌效应。
    楼宇管理     按期完成               为公司新运营私有化输出做好了准备。




挑战及建议解决方案： (1分钟)

    ？？？？？？
    1. 技术栈   努力扩宽自己的知识面， 自学 和向他人请教。
            nodeJs 的尴尬局面。 作为前端的服务端语言。
            前端人员 80%以上的精力研究前端，留给nodejs 的精力不足20%
            nodeJS 本身很少深入的去做服务端。

    2. 公司环境下无法模拟和复现私有云智能设备的问题

        （有一些私有云智能设备的问题，只能在客户现场出现， 在我公司内无法模拟和复现。 给分析排查问题带来了难度和挑战
          远程用户，可能调试花费的时间较长，会占用用户的私人时间
          去客户现场，出动团队，成本有点高
        ）

        建议： 给私有云客户 预留几台供自己调试的额外设备， 既不影响用户使用，也可以减少人员外出的成本。





自我总结        (1分钟)
    自我分析
        我擅长做哪些事情
            1. 塌下心来，研究前端技术。不管多难，不管多累，乐在其中。
                比如场地销控图，使用svg技术，整个技术实现逻辑使自己设计的

            2. 管理自己的事情。
                合理的安排自己的事情，事情的轻重缓急， 是否可以并行。
                将自己的事情写出来，记录好结束时间， 按事情的轻重缓急合理安排， 记录进度状态， 记录当下不能立即解决的小问题。
                这些小问题，等时间方便的时候，再挨个解决，并且勾掉。

            3. 与人交流意见，做事之前一定要弄明白。不懂就要问。
                当自己接到任务之后，可能有一些点不是特别的明白。 小的错误思路，会导致大的行动代价。比如返工
                为了避免这种情况，一定要问清楚。不要怕别人会烦。

            4. 当推进事情遇到困难和阻力时，不能独自解决的时候，尝试向上求助。



        我不擅长做哪些事情

            1. 面对非常强势固执的人，如何说服对方？ 有时候说服他，要花费巨大的口舌成本

            2. 处理计算机系统层面的问题，比如mtool 就有很多这类问题，处理起来比较吃力， 毕竟自己不是这方面的专业人才。




    自我定位  (1分钟)
        与我有主要工作配合的人都有谁，我们是如何配合完成工作的，我对自己在团队未来发展的规划



        与我有主要工作配合的人有  筑梦和智效两个团队的所有人。


        1.开发过程中把顺带看出bug及时告知对方,并且及时更正。减少bug数量，减少测试写bug的时间，减少开发人员阅读bug 的时间。
        减少三方的工作量，提高工作效率。

            与张天翼的合作例子，
            与孙东风的合作例子

        2.对于产品设计的不合理性，提出改进意见。告知产品经理。 推动产品的完善。

            与孙东风的合作例子


        未来规划

            接下来就走技术路线。 塌下心来，一心研究前端技术。并将自己的研究成果分享给大家。
            带动团队整体的技术提升。 近期我们准备分享webRtc,现在正在筹备阶段，欢迎大家前来倾听。


            ?????????
            如果有机会，还是愿意主导设计一款程序的。




    我的收获与成长： (2分钟)

        1、我感兴趣的专业领域，以及2020年在该专业领域所做的积累与贡献，建议1P

            我感兴趣的专业领域是webRtc
            积累：
                1. 积累了整个webRtc 的框架和流程的知识，作为理论基础。 知识点包括 IceServer, 信令服务器， 音视频编解码

            贡献
                1. 完成了公司mtool 视频会议的升级工作， 有网页版的声网，转变为桌面版的zoom
                2. 解决了electron 版本升级导致的本地投屏的兼容性问题。保证了electron 版本的稳定过度。




            这部分内容需要仔细斟酌，咨询一下海哥的意见。？？？？？？？？？？？？？？？
        2、我对自己在2020年表现最不满意的一次工作经历，以及我从中学到的东西，建议1P

             正视问题，说真话？？？？？？？？

             最不满意的工作经历是 由于自己过于的追求技术，从而放松了对团队的管理。与筑梦团队的关系逐渐拉远，
             引起集体和上级对自己的不满，导致后来自己不再做管理岗位。

                 筑梦方面： 只身一人投入智效工作，放松了对筑梦前端团队的管理。与筑梦团队的关系逐渐拉远，引起筑梦团队对自己的不满，
                 智效方面： 只身一人投入智效工作，因为工作压力大，情绪有波动，没有处理好与智效团队的关系。

                 最终引起领导的不满，导致后来自己不再做管理岗位。



             从中学到的东西：

                 筑梦方面
                        对于技术和管理始终都不能放松，要达到技术与管理的平衡。投入多，产出多。  投入少，产出少。
                        不能疏远团队，要有心与心的交流沟通。
                 智效方面
                        压力大应该好好的调节自己，不应该将情绪是放在工作中。

             面对困境，自己不能沉沦，跌倒了，再爬起来。整理一下心情，将自己的事情做好，做到问心无愧，继续向前走，一切会好起来的。










相片








话术
  大家好，我是来自智能研发部的冉成。

  我将从3个方面进行我的述职。
  第一部分是我的成长之路。


  我毕业于河北科技学院，最高学历本科。岗位是前端架构师，主要职责是设计项目架构，技术难点攻关。


  下面是我的工作总结

    第一个亮点 是智能设备的科技， 梦想家加科技，科技科技出成绩

        新开发了视频会议，视频会议使用时长增长了6倍，稳定性有了大幅度提升
        在350和so 上面做了大量人脸识别开发， 为龙湖商汤人脸识别项目提供了技术支持
        在微信公众号和so 上面接入了人证一体机， 为龙湖高和人证一体机项目提供了技术支持




    第二个亮点 是新运营的管理， 梦想家加管理，管理管理提效率

        我重点参与了新运营的其中3块

        1.楼宇管理从新运营抽离出来，
        2.从用户体验上对销控图做了大量优化，
        3.对发票进行了重构，提升了开票的效率和准确率。


    这是一张视频会议的曲线图，来自于数据大屏。描述每个月的使用时长。
    下面这张图是具体的数值，
    6月 2122，
    7月 2660

    这些数字代表什么意思呢， 我们一起分析一下。


    2020年的最重要事项 还是视频会议。
    由于时间关系，说快一些。


    下面是遇到的困难 和 建议









龙湖同步卡号
开启同步任务 30分钟一次


发送register
mqtt 获取设备的配置,获取调用接口的权限。

调用java 接口 获取人脸服务器地址，返回给python 使用
调用java 接口，索要token, ,此token 通过mqtt下发，返回给python 使用


会议室门禁，普通门禁



350门禁 内存溢出

typescript



微信

主动拜访
访客邀请，发给微信好友
判断园区是否启用了人证一体机，如果启用的话， 需要填写身份证号/护照号
填写个人体温
填写随行人员



销控图
    展示订单开始时间，结束时间，

    单个订单展示的信息面积更大

    建议增加时间筛选，一目了然


财务
    费用类型设置








*/
